Revit 2027 API
ColumnAttachment.IsValidTarget Method
Overload List
Name | Description
IsValidTarget(Boolean, Element) |  Says whether the element can be used as a target for a new attachment.
IsValidTarget(FamilyInstance, Element) |  Says whether the element can be used as a target for a new attachment.
Top
See Also
Reference
ColumnAttachment Class
Autodesk.Revit.DB Namespace